IDEA Connection Link
ConnectionSrv.GetConnectionModel Method
 GetConnectionModel
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public ConnectionData GetConnectionModel(
	Guid connectionId
)
Public Function GetConnectionModel (
	connectionId As Guid
) As ConnectionData
public:
ConnectionData^ GetConnectionModel(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetConnectionModel(System.Guid)"]
Return Value
Type: ConnectionData
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.GetConnectionModel(System.Guid)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace